raibisch/ESP32_DYNECALC/src/main.cpp
    case ESP_SLEEP_WAKEUP_EXT1 : debug_println("** Wakeup caused by external signal using RTC_CNTL"); break;

    case ESP_SLEEP_WAKEUP_TIMER :debug_println("** Wakeup caused by timer");
    iInit = 0;
    break;
    case ESP_SLEEP_WAKEUP_TOUCHPAD : debug_println("Wakeup caused by touchpad"); break;

    case ESP_SLEEP_WAKEUP_ULP : debug_println("Wakeup caused by ULP program"); break;

    default : debug_printf("**Wakeup was not caused by deep sleep: %d\n",wakeup_reason); 
     iInit = 1;
    break;
  }

  esp_sleep_pd_config(  ESP_PD_DOMAIN_RTC_SLOW_MEM,   ESP_PD_OPTION_ON );
  esp_sleep_pd_config(  ESP_PD_DOMAIN_RTC_FAST_MEM,   ESP_PD_OPTION_OFF);

   
 

    /*
    if(M5.M5Ink.isInit() == false)
    {
        debug_println("Ink Init failed");
        while(1) delay(100);
    }
    */

   M5.M5Ink.clear(1);
   TimePageSprite.creatSprite(0,0,200,160,false);
   
  M5.rtc.GetDate(&date);
  M5.rtc.GetTime(&time);

  // Update um Mitternacht
  if (time.Hours==0 && time.Minutes==0) 
  {
    iInit = 1;
  }
        
  if ((iInit == 1))
  {
          iInit = 0;
          initSPIFFS();
          initFileVarStore();
          initWiFi();
          if (!ntpclient.begin())
          {
            ESP.restart();
          }
          smartgrid.init();
          time_t t = ntpclient.getUnixTime();
          smartgrid.downloadWebData(&t,false);
          for (size_t i = 0; i < 24; i++)
          {
           rtc_userhour_price[i] = smartgrid.unsorted_userhour_price[i];
           debug_printf("price: %d, hour: %d\r\n", rtc_userhour_price[i], i);
          }
          
          debug_println("\r\ninit ready disconnect WIFI !")
          WiFi.disconnect(true);
          WiFi.mode(WIFI_OFF); 
          time.Hours = ntpclient.getTimeInfo()->tm_hour;
          time.Minutes = ntpclient.getTimeInfo()->tm_min;
          time.Seconds = ntpclient.getTimeInfo()->tm_sec;
          date.Date   = ntpclient.getTimeInfo()->tm_mday;
          date.Month  = ntpclient.getTimeInfo()->tm_mon+1;
          date.Year   = ntpclient.getTimeInfo()->tm_year+1900;
          date.WeekDay= ntpclient.getTimeInfo()->tm_wday;
          M5.rtc.SetTime(&time);
          M5.rtc.SetDate(&date);
  }

    M5.M5Ink.clear(); 
  
    drawBatterylevel();
    drawTimeAndDate(time, date);
    drawHourPrice(time.Hours);
    TimePageSprite.pushSprite(); 
    //delay(1000);

    timeToSleep = 3600 - (time.Minutes*60);
    esp_sleep_enable_timer_wakeup(timeToSleep * uS_TO_S_FACTOR);
    debug_println("Setup ESP32 to sleep in  " + String(timeToSleep) + " Seconds");

    debug_println("before M5.I5Ink.deepsleep()");
    pinMode(POWER_HOLD_PIN,OUTPUT);
    digitalWrite(POWER_HOLD_PIN,HIGH);
    gpio_hold_en(GPIO_NUM_12); // tell the esp to keep pin high even in sleep
   
    M5.rtc.clearIRQ();
    //M5.rtc.SetAlarmIRQ(3600-(time.Minutes*60));
    M5.M5Ink.deepSleep();

/*
    M5.rtc.disableIRQ();
    M5.rtc.SetAlarmIRQ(3600-(time.Minutes*60));
    gpio_wakeup_enable(GPIO_NUM_19, gpio_int_type_t::GPIO_INTR_LOW_LEVEL);
    esp_sleep_enable_gpio_wakeup();
    M5.shutdown();
*/
  
    pinMode(POWER_HOLD_PIN,OUTPUT);
    digitalWrite(POWER_HOLD_PIN,HIGH);
    gpio_hold_en(GPIO_NUM_12); // tell the esp to keep pin high even in sleep
   
    Serial.flush(); 
    esp_deep_sleep_start();           
}


#endif
      
////////////////////////////////////////////////////
/// @brief setup
////////////////////////////////////////////////////
void setup() 
{
#ifdef M5_COREINK
  initM5CoreInk();
#else
  initLED();
  setcolor('w'); //white
  setLED(1);
  initRelay();
  Serial.begin(115200);                                           
  delay(500);
  Serial.println("***START***");

  initFS();
  initFileVarStore();
  Serial.print("--------------------------------------------------");
  setLED(0);
  initWiFi();
  initWebServer(); 
  smartgrid.init();
  smldecoder.init(varStore.varSML_s_url.c_str(), varStore.varSML_s_user.c_str(), varStore.varSML_s_password.c_str());
  delay(200);
  setLED(0);
#endif
}

///////////////////////////////////// TimePageSprite.drawString(20,10,buf, &Font0);///////////
/// @brief loop
////////////////////////////////////////////////
void loop() 
{
#ifndef M5_COREINK
   if (millis() - TimerSlowDuration > TimerSlow) 
   {
    TimerSlow = millis();                      // Reset time for next event
    testWiFiReconnect();

    ntpclient.update();
    Serial.printf("IP:%s  Time %s\r\n",SYS_IP, ntpclient.getTimeString()); 
#ifdef WEB_APP
    AsyncWebLog.printf("IP:%s  Time %s\r\n",SYS_IP, ntpclient.getTimeString()); 
#endif

#if defined SML_TASMOTA || defined SML_TIBBER
    smldecoder.read();
#ifdef WEB_APP
    AsyncWebLog.printf("SML %dW  IN:%.2f kWh  OUT:%.2f kWh\r\n", smldecoder.getWatt(), smldecoder.getInputkWh(), smldecoder.getOutputkWh());
#endif
#endif
    time_t tt = ntpclient.getUnixTime();
    smartgrid.loop(&tt);
#ifdef CALC_HOUR_ENERGYPRICE
    smartgrid.calcHourPrice(&tt, smldecoder.getInputkWh());
#endif
  }
  
  // fast blink
  if (millis() - TimerFastDuration > TimerFast)
  {
    TimerFast = millis();
    blinkLED();
  }
#endif // no CoreInk
#ifndef WEB_APP
    debug_printf("Tibber-Price:%s\r\n", String((smartgrid.getUserkWhPrice(ntpclient.getTimeInfo()->tm_hour)),1));
#endif
}

